var err=new Object();
err.id={
    '1':"wifi定时开关冲突或时间间隔小于5分钟",
    '2':"wifi定时开关参数缺失",
    '3':"规则数量超出限制",
    '-73':'待认证设备已离线或已拉入黑名单',
    '-74':'网关正在配置中，请稍候再试',
    '-75':'获取升级信息失败，请稍后重试',
    '-76':'存在已开启的规则',
    '-77':"规则冲突",
    '-78':"不是内网(LAN端口)ip",
    '-79':"获取升级进度失败",
    '-83':"wifi密码长度不足",
    '-84':"wifi密码强度弱",
    '-86':"未找到对应的数据",
    '-88':"WAN侧服务未开启",
    '-89':"WAN侧无法连接到网络",
    '-90':"WAN侧无法获取DNS",
    '-91':"WAN侧网关错误或无法获取",
    '-92':"WAN侧ip地址缺失",
    '-93':"密码错误",
    '-94':"解密失败",
    '-95':"内部逻辑错误",
    '-96':"值错误",
    '-97':"关键参数缺失",
    '-98':"数据请求方式错误",
    '-99':"数据请求链接错误",
};
err.error_msg=function (res) {
    var errorcode=res.errorcode;
    if(err.id[errorcode]){
        resultTipshow(0,err.id[errorcode]);
    }else {
        resultTipshow(0,res.msg);
    }
}